/* `welcomeLabel` UILabel text default value */
"Welcome" = "Bem-vindo";

/* `thankyouLabel` UILabel text default value */
"ThankyouMessage" = "Obrigado por transferir";

/* `instructionTextView` UITextView text default value with \".notConfigurated\" state */
"WelcomeInstruction" = "Siga as instruções que recebeu no e-mail de boas-vindas para iniciar o processo de ativação.";

/* `instructionTextView` UITextView text default value with \".isConfigured\" state */
"ConfiguredInstruction" = "Controle a sua gestão de tarefas diárias e colabore facilmente em projetos.";

"ScanInstruction" = "Digitalize o código QR seguro para iniciar o processo de ativação.";

"DiscoveryServiceInstruction" = "Introduza o seu endereço de e-mail para iniciar o processo de ativação.";

/* checking the account(email address) user entered in discovery service */
"CheckingAccountKey" = "A verificar a conta...";

/* `signInButton` UIButton's titleLabel?.text default value */
"SignIn" = "Iniciar";

"Scan" = "Digitalizar";

/* `demoLabel` UILabel text default value */
"Explore" = "Quer explorar?";

/* `demoButton` UIButton's titleLabel?.text default value */
"TryDemo" = "Experimentar a demonstração";

/* The title for the passcode setup screens. */
"SetPasscodeKey" = "Definir código de acesso";

/* The title for the enter passcode screen. */
"PasscodeKey" = "Código de acesso";

/* The title for the Choose Passcode screen. */
"ChoosePasscodeTitleKey" = "Selecionar código de acesso";

/* The title for the Confirm Passcode screen. */
"ConfirmPasscodeTitleKey" = "Confirmar código de acesso";

/* The message on the confirm passcode screen for passcode setup. */
"EnterPasscodeAgainKey" = "Introduza novamente o seu código de acesso.";

/* The message on the confirm passcode screen for passcode change. */
"ConfirmPasscodeKey" = "Confirme o seu código de acesso.";

/* The message on the input passcode screen. */
"EnterYourPasscodeKey" = "Introduza o seu código de acesso.";

/* The title for the passcode change screens. */
"ChangePasscodeKey" = "Alterar código de acesso";

/* The message on the input passcode screen in change passcode. */
"EnterYourCurrentPasscodeKey" = "Introduza o seu código de acesso atual.";

/* The button title string used both in passcode and\n touch ID screens to indicate not to setup now. */
"NotNowKey" = "Agora não";

/* The button title string used on the second passcode setup\n to go back to the first screen. */
"BackKey" = "Voltar";

/* The button title string used on the first passcode setup\n to go to the next screen. */
"NextKey" = "Seguinte";

/* The button title string used on the passcode input screen (not in the change passcode sequence)\n When the passcode input screen is in the change passcode sequence, the button title should be changed \"Next\" */
"DoneKey" = "Concluído";

/* The main message format on the setup passscode screen.\n The %d will display the number of characters required from\n the passcode policy. */
"PasscodeChooseMinCharKey" = "Selecione um código de acesso com pelo menos %d carateres para desbloquear a aplicação móvel.";

/* The main message format on the setup passscode screen when the\n isDititsOnly property of the passcode policy is true.\n The %d will display the number of digits required from\n the passcode policy. */
"PasscodeChooseMinDigitKey" = "Selecione um código de acesso com pelo menos %d dígitos para desbloquear a aplicação móvel.";

/* The message for passcode to include the required character groups\n when passcode policy requires it. */
"PasscodeRequiredGroupKey" = "Incluir o seguinte:";

/* The group name for lower case letters. */
"LowerCaseKey" = "Minúscula (a-z)";

/* The group name for upper case letters. */
"UpperCaseKey" = "Maiúscula (A-Z)";

/* The group name for digits. */
"DigitsKey" = "Dígitos (0-9)";

/* The group name for non-alphabetic characters. */
"Non-alphaKey" = "Símbolos (!@#...)";

/* The button title for resetting passcode. */
"ResetPasscodeKey" = "Repor código de acesso";

/* Alert message when validate method of FUIPasscodeValidationDelegate\n returning false for the passcode user entered in setup passcode. */
"PasscodeValidationFailedKey" = "Validação do código de acesso falhada.";

/* Alert message when the passcode user entered was rejected by\n the FUIPasscodeControllerDelegate's shouldTryPasscode function. */
"PasscodeRejectedKey" = "O código de acesso foi rejeitado pelo FUIPasscodeControllerDelegate.";

/* The alert button title used on passcode validation failed, or passcode rejected. */
"RetryKey" = "Repetir";

/* The title for setup touch ID screen. */
"TouchIDKey" = "Touch ID";

/* The title for setup touch ID screen. */
"FaceIDKey" = "Face ID";

/* This is to be used combined with \"Touch ID\" or \"Face ID\", e.g., \"Touch ID is now available!\" */
"IsNowAvailableKey" = " não está disponível agora.";

/* The first paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage1Key" = "A ativação do Touch ID irá permitir-lhe um acesso mais rápido às informações.";

/* The second paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage2Key" = "Pode ativar ou desativar esta funcionalidade a qualquer momento nas Definições.";

/* The first paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage1Key" = "Ative o Touch ID para um acesso rápido e seguro.";

/* The second paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage2Key" = "Se o Touch ID estiver desativado, ser-lhe-á pedido o código de acesso do dispositivo.";

/* The first paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage1Key" = "A ativação do Face ID irá permitir-lhe um acesso mais rápido às informações.";

/* The second paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage2Key" = "Pode ativar ou desativar esta funcionalidade a qualquer momento nas Definições.";

/* The first paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage1Key" = "Ative o Face ID para um acesso rápido e seguro.";

/* The second paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage2Key" = "Se o Face ID estiver desativado, ser-lhe-á pedido o código de acesso do dispositivo.";

/* The alert title to ask user add fingerprints to use Touch ID. */
"UseTouchIDTitleKey" = "Para utilizar o Touch ID, adicione impressões digitais nas definições do dispositivo.";

/* The alert message to ask user add fingerprints to use Touch ID. */
"UseTouchIDMessageKey" = "Pode fazer isso a qualquer momento em Definições - Touch ID & Código de acesso.";

/* The alert title to ask user add fingerprints to use Face ID. */
"UseFaceIDTitleKey" = "Para utilizar o Face ID, inscreva o Face ID nas definições do dispositivo.";

/* The alert message to ask user add fingerprints to use Face ID. */
"UseFaceIDMessageKey" = "Pode fazer isso a qualquer momento em Definições - Face ID & Código de acesso.";

/* The message for the link on the Touch ID screen. */
"LearnMoreKey" = "Saiba mais sobre o Touch ID";

/* The message for the link on the Face ID screen. */
"LearnMoreFaceIDKey" = "Saiba mais sobre o Face ID";

/* The button title to enable Touch ID authentication. */
"EnableKey" = "Ativar";

/* The message displayed when authticate with Touch ID. */
"AuthWithTouchIDKey" = "Autenticar com Touch ID";

/* The message displayed when authticate with Face ID. */
"AuthWithFaceIDKey" = "Autenticar com Face ID";

/* The title on the navigation bar. */
"TouchIDErrorNavigationTitleKey" = "Erro";

/* The error title. */
"AuthenticationErrorKey" = "Erro de autenticação";

/* The error message for Touch ID devices. */
"AuthenticationTouchIDMessageKey" = "Efetue a autenticação com Touch ID para utilizar a aplicação móvel.";

/* The error message for Face ID devices. */
"AuthenticationFaceIDMessageKey" = "Efetue a autenticação com Face ID para utilizar a aplicação móvel.";

/* The authenticate button text. */
"AuthenticateKey" = "Autenticar";

/* The message when the passcode entered in confirm passcode screen\n does not match with the one entered in the setup passcode screen. */
"PasscodeNotMatchKey" = "Os códigos de acesso não coincidiram. Tente novamente.";

/* The message format to be displayed when user entered wrong passcode\n and the remaining number of retries is greater than 1. */
"AttemptsLeftKey" = "Ainda tem %d tentativas.";

/* The message format to be displayed when user entered wrong passcode\n and there is only one remaining retry. */
"OneAttemptLeftKey" = "Ainda tem 1 tentativa.";

/* The first paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"MaxAttemptsReachedKey" = "Não tem mais tentativas.";

/* The second paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"EnterCredentialsKey" = "Inicie sessão para repor o código de acesso.";

/* The text of the dismiss button on the alert. */
"OKKey" = "OK";

/* The message on the passcode screen when user entered wrong passcode\n and there is no limit on the number of retries. */
"RetryPasscodeKey" = "Código de acesso incorreto. Tente novamente.";

/* The scan page title string. */
"ScanKey" = "Digitalizar";

/* The title of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"ScanUnsuccessfulKey" = "Digitalização sem êxito";

/* The second line of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"SelectAnotherImageKey" = "Selecione uma imagem de código QR.";

/* The title of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"InvalidQRCodeKey" = "Código QR inválido";

/* The second line of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"QRCodeNotRecognizedKey" = "O código QR não foi reconhecido.";

/* The title of the alert to request photo access. */
"AllowPhotoAccessKey" = "Permitir acesso a fotografias";

/* The message of the alert to request photo access. */
"GiveAccessToPhotoSettingsKey" = "Para escolher uma imagem de código QR, permita o acesso às suas fotografias nas definições de privacidade do dispositivo.";

/* The title of the alert to request camera access. */
"AllowCameraAccessKey" = "Permitir acesso à câmara";

/* The message of the alert to request camera access. */
"GiveAccessToCameraSettingsKey" = "Para digitalizar com a câmara, permita o acesso à câmara nas definições de privacidade do dispositivo.";

/* *\n The alert action title to go to Settings app. */
"SettingsKey" = "Definições";

/* The title string for the QR code scan confirmation screen. */
"ConfirmationKey" = "Confirmação";

/* The success message for the QR code scan confirmation screen. */
"ScanSucceededKey" = "Digitalização com êxito. Será ligado a:";

/* The title string for the \"Continue\" button */
"ContinueKey" = "Continuar";

/* The title string for the back bar button on activation screen */
"BackBarButtonForActivationScreenKey" = "Iniciar";

/* FUIActivation Screen - headlineLabel */
"FUIActivationScreen_headlineLabel" = "Ativação";

/* FUIActivation Screen - detailLabel */
"FUIActivationScreen_detailLabel" = "Se tiver recebido um e-mail de boas-vindas, siga a ligação de ativação no e-mail. Caso contrário, introduza o seu endereço de e-mail ou digitalize o código QR para iniciar a inclusão.";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_primaryActionButtonTitle" = "Seguinte";

/* FUIActivation Screen - subheadlineLabel */
"FUIActivationScreen_subheadlineLabel" = "Ou";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_secondaryActionButtonTitle" = "Digitalizar";

/* FUIEULAView Screen - agree button */
"AgreeKey" = "Concordar";

/* FUIEULAView Screen - disagree button */
"DisagreeKey" = "Discordar";

/* The authentication title. */
"AuthenticationKey" = "Autenticação";

/* The basic authentication message. */
"basicAuthenticationMessageKey" = "Forneça o seu nome de utilizador e palavra-passe para autenticar.";

/* Username input field placeholder string */
"usernameKey" = "nome de utilizador";

/* Password input field placeholder string */
"passwordKey" = "palavra-passe";

/* Sign In button string. */
"SignInKey" = "Iniciar sessão";

/* Error message when failed to sign in. */
"SignInErrorKey" = "Credenciais incorretas. Tente novamente.";

/* The dynamic authentication message. */
"DynamicAuthenticationMessageKey" = "Forneça as informações abaixo para iniciar o processo de ativação.";

/* The message displayed on the banner when verifying information user entered. */
"VerifyingMessageKey" = "A verificar as informações...";

/* Cancel button string. */
"CancelKey" = "Cancelar";

/* Allow button string. */
"AllowKey" = "Permitir";

/* Deny button string. */
"DenyKey" = "Negar";

/* No button string. */
"NoKey" = "Não";

/* Quit button string. */
"QuitKey" = "Sair";

/* GiveConsent button string. */
"GiveConsentKey" = "Consentir";

/* Navbar title string. */
"StepKey" = "Passo";

/* Navbar title string. */
"OfKey" = "de";

/* CancelConfirmation message string. */
"CancelConfirmationKey" = "Tem a certeza de que pretende sair do processo de inclusão?";

/* MandatoryMessage button string. */
"MandatoryMessageKey" = "Sem o consentimento, não poderá continuar a inclusão.";

/* Switch User button string. */
"SwitchOrAddUserKey" = "Mudar ou adicionar utilizador";

/* Title for Log In button */
"LogInKey" = "Iniciar sessão";

/* Placeholder text in search bar for searching users in multi-user login controller */
"SearchUsersKey" = "Procurar utilizadores neste dispositivo";

/* The button title for forgot passcode. */
"ForgotPasscodeKey" = "Esqueceu-se do código de acesso?";

/* Title for Loction */
"PNLoctionTitleKey" = "Ative os serviços de localização para que possa utilizar o mapa e as funcionalidades de navegação";

/* Title for Notifications */
"PNNotificationsTitleKey" = "Ative as notificações para que possa ser alertado sobre anúncios importantes";

/* Title for Photos */
"PNPhotosTitleKey" = "Ative o acesso à biblioteca de fotografias para que possa permitir a partilha de fotografias e aceder à biblioteca de fotografias";

/* Title for Calendar */
"PNCalendarTitleKey" = "Ative o acesso ao calendário para que possa reservar salas e ver as suas reuniões";

/* Title for Camera */
"PNCameraTitleKey" = "Ative a câmara para que possa iniciar sessão e verificar utilizando o Face ID";

/* Subtitle for FUIPrivacyNoticeView */
"PNSubtitleKey" = "Pode alterar esta permissão mais tarde utilizando as definições da aplicação";

/* FooterText for FUIPrivacyNoticeSettingsController */
"PNSettingsFooterTextKey" = "A aplicação utiliza as permissões abaixo indicadas para lhe dar a melhor experiência que lhe proporcionamos";

/* FooterText of Location for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsLocationFooterTextKey" = "Permita que a aplicação aceda à sua localização e o notifique quando a estiver a utilizar.\n\nPara definir ou editar a permissão de localização, abra as definições de iOS > Toque em \"Localização\" > Toque em \"Aplicação\" > Selecione a definição de permissão de localização preferida";

/* FooterText of Notifications for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsNotificationsFooterTextKey" = "Permita que a aplicação aceda às Notificações e o notifique quando a estiver a utilizar.\n\nPara definir ou editar a permissão de notificações, abra as definições de iOS > Toque em \"Notificações\" > Toque em \"Aplicação\" > Selecione a definição de permissão de notificações preferida";

/* FooterText of Photos for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsPhotosFooterTextKey" = "Permita que a aplicação aceda às Fotografias e o notifique quando a estiver a utilizar.\n\nPara definir ou editar a permissão de fotografias, abra as definições de iOS > Toque em \"Fotografias\" > Toque em \"Aplicação\" > Selecione a definição de permissão de fotografias preferida";

/* FooterText of Camera for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCameraFooterTextKey" = "Permita que a aplicação aceda à Câmara e o notifique quando a estiver a utilizar.\n\nPara definir ou editar a permissão de câmara, abra as definições de iOS > Toque em \"Câmara\" > Toque em \"Aplicação\" > Selecione a definição de permissão de câmara preferida";

/* FooterText of Calendar for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCalendarFooterTextKey" = "Permita que a aplicação aceda ao Calendário e o notifique quando o estiver a utilizar.\n\nPara definir ou editar a permissão de calendário, abra as definições de iOS > Toque em \"Calendário\" > Toque em \"Aplicação\" > Selecione a definição de permissão de calendário preferida";

/* The button title for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingKey" = "Abrir definições de iOS";

